In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [2]:
FamilyList = ["Abdullah", "Fatima", "Najlaa"]
F = pd.Series(FamilyList, index=[1,2,3])
F

1    Abdullah
2      Fatima
3      Najlaa
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [3]:
F.index = [11,12,13]
F

11    Abdullah
12      Fatima
13      Najlaa
dtype: object

## Q3: Retrieve First and second elements.

In [9]:
F[0:2]

11    Abdullah
12      Fatima
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [12]:
F1 = pd.Series({14: 'Noura', 15: 'Najlaa'})
F = F.append(F1)
F
F.drop_duplicates()

C:\Users\alsow\AppData\Local\Temp\ipykernel_28376\4139182391.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  F = F.append(F1)

11    Abdullah
12      Fatima
13      Najlaa
14       Noura
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [13]:
 Data = {'ID': ['11111', '22222', '33333', '44444', '55555', '66666', '77777'],
        'Name': ['Najlaa', 'Noura', 'Nouf', 'Lama', 'Lamees', 'Mohammed', 'Moataz'],
        'GPA': [4.38, 4.60, 4.75, 3.97, 3.87, 5.00, 2.99]
       }

StudentData = pd.DataFrame(Data, columns=['ID', 'Name', 'GPA'])
StudentData

      ID      Name   GPA
0  11111    Najlaa  4.38
1  22222     Noura  4.60
2  33333      Nouf  4.75
3  44444      Lama  3.97
4  55555    Lamees  3.87
5  66666  Mohammed  5.00
6  77777    Moataz  2.99

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [16]:
Edu = pd.read_csv('educ_figdp_1_Data.csv')
Edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [26]:
Edu.loc[1:15:, ['TIME', 'GEO']]

    TIME                            GEO
1   2001  European Union (28 countries)
2   2002  European Union (28 countries)
3   2003  European Union (28 countries)
4   2004  European Union (28 countries)
5   2005  European Union (28 countries)
6   2006  European Union (28 countries)
7   2007  European Union (28 countries)
8   2008  European Union (28 countries)
9   2009  European Union (28 countries)
10  2010  European Union (28 countries)
11  2011  European Union (28 countries)
12  2000  European Union (27 countries)
13  2001  European Union (27 countries)
14  2002  European Union (27 countries)
15  2003  European Union (27 countries)

In [27]:
Edu[1:15]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e
11,2011,European Union (28 countries),Total public expenditure on education as % of ...,5.25,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
13,2001,European Union (27 countries),Total public expenditure on education as % of ...,4.99,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e